<?php

namespace Database\Seeders;

use App\Models\Article;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class ArticleSeeder extends Seeder
{

    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        // dd();
        // Article::factory()->count(20)->create();
        $data = [
            'title' => [
                'Ускоряющийся филогенез в XXI веке',
                'Понимающий генезис: методология и особенности',
                'Сознание как боль',
                'Концепция как сознание',
                'Напряженный импульс: основные моменты',
                'Почему прост даосизм?',
                'Сенсибельный интеллект в XXI веке',
                'Интеллигибельный интеллект: гипотеза и теории',
                'Почему неоднозначен структурализм?',
                'Дискретность как мир',
                'Сложный дуализм: предпосылки и развитие',
                'Интеллигибельный бабувизм в XXI веке',
                'Заблуждение как реальная власть',
                'Почему очевидна не для всех концепция?',
            ],
            'content' => [
                "Скиннер, однако, настаивал, что автоматизм порождает и обеспечивает стимул. Сновидение притягивает индивидуальный психоз. Созерцание, несмотря на внешние воздействия, рефлектирует позитивистский интеллект. Лидерство непредвзято иллюстрирует даосизм. Репрезентативная система, следовательно, недоступно притягивает интеллект, так, например, Ричард Бендлер для построения эффективных состояний использовал изменение субмодальностей. Бессознательное дискредитирует гештальт.\n Можно предположить, что проекция непосредственно понимает аутизм. Репрезентативная система неумеренно аннигилирует субъект, ломая рамки привычных представлений. Сомнение методологически оспособляет из ряда вон выходящий гравитационный парадокс. В заключении добавлю, воспитание мгновенно.\nОтвечая на вопрос о взаимоотношении идеального ли и материального ци, Дай Чжень заявлял, что созерцание иллюстрирует принцип восприятия, таким образом осуществляется своего рода связь с темнотой бессознательного. Гештальт рассматривается девиантный гомеостаз. Дедуктивный метод понимает закон исключённого третьего.",
                "Представляется логичным, что сновидение индуктивно контролирует конфликт. Ощущение мира преобразует трагический стимул, не учитывая мнения авторитетов. Интеракционизм, следовательно, неравномерен. Катарсис, конечно, заполняет данный онтогенез речи. Идентификация иллюстрирует код, ломая рамки привычных представлений. Как было показано выше, гедонизм оспособляет даосизм.\nМышление интегрирует концептуальный автоматизм. Перцепция понимает под собой аутизм, не учитывая мнения авторитетов. Архетип, следовательно, дискредитирует дуализм. Этот концепт элиминирует концепт «нормального», однако воспитание трансформирует гештальт.\nНадо сказать, что роль вызывает примитивный контраст. Здесь автор сталкивает два таких достаточно далёких друг от друга явления как закон внешнего мира релевантно контролирует филосовский здравый смысл. Идеи гедонизма занимают центральное место в утилитаризме Милля и Бентама, однако тест заполняет смысл жизни. Исчисление предикатов оспособляет сложный гендер. Все это побудило нас обратить внимание на то, что бабувизм рефлектирует код.",
                "Закон исключённого третьего изменяем. Как было показано выше, аналогия изоморфна времени. Стресс не так уж очевиден. Врожденная интуиция понимает конформизм.\nЛидерство, по определению, представляет собой методологический даосизм. Эриксоновский гипноз, по определению, представляет собой трансцендентальный стресс. Код недоступно заполняет гедонизм. Идентификация вызывает социометрический смысл жизни, при этом буквы А, В, I, О символизируют соответственно общеутвердительное, общеотрицательное, частноутвердительное и частноотрицательное суждения. Культ джайнизма включает в себя поклонение Махавире и другим тиртханкарам, поэтому гегельянство критично иллюстрирует бихевиоризм, что вызвало развитие функционализма и сравнительно-психологических исследований поведения.\nОбъект подрывает объект. Интеллект решительно отражает стресс. Аномия, например, откровенна. Агрессия интегрирует гравитационный парадокс. Большую роль в популяризации психодрамы сыграл институт социометрии, который знак создает трагический структурализм в силу которого смешивает субъективное и объективное, переносит свои внутренние побуждения на реальные связи вещей.",
                "Концепция осмысляет непредвиденный закон внешнего мира. Дедуктивный метод создает знак. Здравый смысл нетривиален. Суждение создает гедонизм. Апостериори, сомнение решительно подчеркивает закон внешнего мира. Согласно предыдущему, структурализм подрывает интеллект.\nМир индуцирует гравитационный парадокс. Акциденция понимает под собой онтологический бабувизм, отрицая очевидное. Исчисление предикатов, по определению, транспонирует язык образов, отрицая очевидное. Предмет деятельности неоднозначен. Заблуждение, как принято считать, раскладывает на элементы интеллигибельный гений, хотя в официозе принято обратное.\nДуализм принимает во внимание бабувизм. Искусство амбивалентно индуцирует сложный знак. Гегельянство, по определению, осмысляет конфликт. Заблуждение подрывает субъективный смысл жизни, однако Зигварт считал критерием истинности необходимость и общезначимость, для которых нет никакой опоры в объективном мире. Апостериори, ассоциация очевидна не для всех.",
                "Гений раскладывает на элементы непредвиденный знак. Можно предположить, что заблуждение преобразует конфликт. Катарсис, как следует из вышесказанного, создает дуализм, отрицая очевидное. Интересно отметить, что ощущение мира принимает во внимание закон внешнего мира. Структурализм не так уж очевиден. Вещь в себе творит данный конфликт, при этом буквы А, В, I, О символизируют соответственно общеутвердительное, общеотрицательное, частноутвердительное и частноотрицательное суждения.\nМир оспособляет бабувизм. Надо сказать, что диалектика контролирует язык образов. Герменевтика транспонирует трансцендентальный принцип восприятия, tertium nоn datur. Надо сказать, что исчисление предикатов категорически контролирует напряженный катарсис. Язык образов нетривиален. Суждение ментально контролирует из ряда вон выходящий закон внешнего мира.\nГалактика методологически представляет собой знак. Суждение порождает и обеспечивает гравитационный парадокс, изменяя привычную реальность. Смысл жизни рефлектирует бабувизм. Ощущение мира порождает и обеспечивает данный позитивизм, хотя в официозе принято обратное.",
                "Созерцание творит типичный здравый смысл. Концепция раскладывает на элементы напряженный гравитационный парадокс, хотя в официозе принято обратное. Апперцепция философски трансформирует естественный гедонизм, ломая рамки привычных представлений. Апостериори, реальность очевидна не для всех.\nРеальность, как принято считать, иллюзорна. Платоновская академия откровенна. Созерцание непредвзято рефлектирует примитивный мир. Аналогия контролирует мир. Идеи гедонизма занимают центральное место в утилитаризме Милля и Бентама, однако гений нетривиален. Заблуждение, как принято считать, преобразует типичный катарсис, изменяя привычную реальность.\nЗакон внешнего мира не так уж очевиден. По своим философским взглядам Дезами был материалистом и атеистом, последователем Гельвеция, однако знак выводит предмет деятельности. Отвечая на вопрос о взаимоотношении идеального ли и материального ци, Дай Чжень заявлял, что сомнение осмысленно создает язык образов.",
                "Реальность дискредитирует сенсибельный предмет деятельности. Концепция порождена временем. Моцзы, Сюнъцзы и другие считали, что позитивизм рассматривается бабувизм, не учитывая мнения авторитетов. Даосизм, следовательно, создает онтологический даосизм.\nГравитационный парадокс абстрактен. Галактика порождена временем. Априори, гений преобразует катарсис. Александрийская школа раскладывает на элементы структурализм.\nПредставляется логичным, что знак осмысляет типичный бабувизм, tertium nоn datur. Исчисление предикатов индуктивно рефлектирует гений. Аджива выводит мир, однако Зигварт считал критерием истинности необходимость и общезначимость, для которых нет никакой опоры в объективном мире. Язык образов рефлектирует катарсис.",
                "Гедонизм реально порождает и обеспечивает дедуктивный метод. Конфликт ясен не всем. Согласно мнению известных философов, актуализация раскладывает на элементы напряженный предмет деятельности, изменяя привычную реальность.Отвечая на вопрос о взаимоотношении идеального ли и материального ци, Дай Чжень заявлял, что структурализм неоднозначен. Исчисление предикатов, следовательно, непредсказуемо. Созерцание методологически рефлектирует смысл жизни. Принцип восприятия непредвзято осмысляет естественный позитивизм.\nИнтеллект, следовательно, осмысляет катарсис. По своим философским взглядам Дезами был материалистом и атеистом, последователем Гельвеция, однако исчисление предикатов амбивалентно. Современная критика порождена временем. Любовь понимает под собой сенсибельный позитивизм, изменяя привычную реальность. Бабувизм подчеркивает естественный интеллект. По своим философским взглядам Дезами был материалистом и атеистом, последователем Гельвеция, однако суждение решительно творит неоднозначный предмет деятельности.",
                "Закон внешнего мира понимает под собой предмет деятельности. Здравый смысл рассматривается сенсибельный дуализм. Апостериори, вероятностная логика подрывает типичный дуализм. Исчисление предикатов индуцирует конфликт.\nКонфликт прост. Ощущение мира методологически подрывает дедуктивный метод. Надо сказать, что освобождение трансформирует мир. Представляется логичным, что сомнение рефлектирует субъективный знак. Согласно предыдущему, дедуктивный метод осмысляет мир.\nСозерцание непредвзято осмысляет здравый смысл. Априори, даосизм преобразует интеллигибельный бабувизм, ломая рамки привычных представлений. Надстройка, конечно, дискредитирует трансцендентальный закон исключённого третьего. Идеи гедонизма занимают центральное место в утилитаризме Милля и Бентама, однако созерцание раскладывает на элементы трагический дедуктивный метод.",
            ],
        ];
        for ($i = 0; $i < 20; $i++) {
            Article::factory()->create([
                'title' => $data['title'][$i] ?? $data['title'][array_rand($data['title'])],
                'content' => $data['content'][$i] ?? $data['content'][array_rand($data['content'])],
            ]);
        }
    }
}
